{"_id":{"$oid":"5d0a929d43af74096fced8f3"},"topic":"Family","title":"Barbie","content":"Barbie's full name is Barbara Millicent Roberts. Barbie is a fashion doll manufactured by the American toy-company Mattel, Inc. and launched in March 1959. She has gone through many changes throughout the years from her debut in 1959, to now she comes in all varieties. Ruth Handler, after seeing her daughter Barbara assigning her dolls adult roles, wished for a more grown-up doll for children to play with, as most toy dolls during the 1950s were modled after infants. And on a trip to germany with her husband, a co-founder of mattel, she found Bild Lilli Dolls which became the inspiration for Barbie dolls."}
{"_id":{"$oid":"5d0a979543af74096fced95d"},"topic":"Pets","title":"Tawny","content":"This noble steed of Barbie is by her mistress’s side with just a whistle. Living the fab life with Barbie has certainly gone to her head. She is lovably neurotic about her looks — from her immaculate mane to her designer horseshoes."}
{"_id":{"$oid":"5d0a979543af74096fced960"},"topic":"Miscellaneous","title":"Computer Engineer Story Controversy","content":"In 2010, Barbie wanted a hot tech job, but she found herself in hot water instead when a companion book entitled Barbie: I Can Be A Computer Engineer went viral a few years later, with critics saying that it was sexist. Thought Barbie was described in the book as a computer engineer creating a new game, it turns out that she needs the help of two male colleagues, Steven and Brian, to actually make the final product. Backlash was severe, and Mattel apologized, pulling the book from shelves soon after."}
{"_id":{"$oid":"5d0a979543af74096fced963"},"topic":"Movies/TV","title":"Barbie Dreamhouse Adventures","content":"Barbie Dreamhouse Adventures is an animated series by Mainframe Studios. It premiered on Netflix. The official description is, 'Get to know Barbie and her BFFs -- including next-door neighbor Ken -- in this animated vlog of adventures filmed inside her family's new dreamhouse.' There is an app for the show."}
{"_id":{"$oid":"5d0a979543af74096fced966"},"topic":"Miscellaneous","title":"Happy Birthday, Barbie","content":"She was born on March 9, 1959. Barbie's official birthday represents her public debut at the 1959 American International Toy Fair in New York. She stood 11 inches tall and was dressed for a pool party in her black and white striped one-piece. Barbie was instantly recognizable as the only toy in the doll aisle that wasn't modeled as a baby or a little kid—having a grown woman as a plaything for children was an entirely new concept."}
{"_id":{"$oid":"5d0aa42843af74096fcedcac"},"topic":"Family","title":"George Roberts","content":"George is the father of Barbie and her various siblings, and husband of Margaret Rawlins Roberts. He is an engineer. Originally just a book character, he has not been issued in doll form but has appeared for the first time in animation as Barbie's father in Netflix's show 'Barbie: Dreamhouse Adventures'."}
{"_id":{"$oid":"5d0aa42843af74096fcedcaf"},"topic":"Family","title":"Margaret Rawlins Roberts","content":"Margaret is the mother of Barbie and her various siblings. She is a software engineer and has an older sister named Millicent. Also originally a book character, she has not been issued in doll form, however, she made her first on-screen appearance in the digital series 'Barbie: Dreamhouse Adventures'."}
{"_id":{"$oid":"5d0aa42843af74096fcedcb2"},"topic":"Family","title":"Skipper Roberts","content":"The first character added to Barbie's family, Skipper is Barbie's younger sister. She was first introduced with blue eyes and a variety of hair colors like blonde, brown, aan). Starting in 1996 Skipper was re-branded as Barbie's 'teen' sister. In 2010 Barbie's sisters got revamped once again, this time Skipper was given brown hair and colored streaks in her hair. She was one of the main characters in the 'Barbie: Life in the Dreamhouse' series. Now she stars along with Barbie in Barbie: Dreamhouse Adventures on Netflix."}
{"_id":{"$oid":"5d0aa42843af74096fcedcb5"},"topic":"Family","title":"Stacie Roberts","content":"Stacie is one of Barbie's younger sisters. Stacie has light brown hair and green eyes. She is a preteen and the most athletic of the Roberts. Her favorite sport is soccer. She was one of the main characters in the 'Barbie: Life in the Dreamhouse' series. Now she stars along with Barbie in Barbie: Dreamhouse Adventures on Netflix."}
{"_id":{"$oid":"5d0aa42843af74096fcedcb8"},"topic":"Family","title":"Chelsea Roberts","content":"Chelsea Roberts is Barbie's youngest sister. Chelsea was originally called Kelly. She was renamed in 2010. She is small, with blue eyes and blonde hair a little lighter than Barbie's. She was one of the main characters in the 'Barbie: Life in the Dreamhouse' series. Now she stars along with Barbie in Barbie: Dreamhouse Adventures on Netflix."}
{"_id":{"$oid":"5d0b97e8771b219e2a2a99af"},"topic":"Pets","title":"Blissa","content":"One of the sisters pets, she is a small white cat. She was a pet in the webseries 'Barbie: Life in the Dreamhouse'. She is a family pet again, along with 4 puppies, on the Netflix series 'Barbie: Dreamhouse Adventures'."}
{"_id":{"$oid":"5d0b97e8771b219e2a2a99b2"},"topic":"Pets","title":"Taffy","content":"One of the sisters 4 puppies on the Netflix series 'Barbie: Dreamhouse Adventures'. She is Barbie's puppy."}
{"_id":{"$oid":"5d0b97e8771b219e2a2a99b5"},"topic":"Pets","title":"DJ","content":"One of the sisters 4 puppies on the Netflix series 'Barbie: Dreamhouse Adventures'. He is Skipper's puppy."}
{"_id":{"$oid":"5d0b97e8771b219e2a2a99b8"},"topic":"Pets","title":"Rookie","content":"One of the sisters 4 puppies on the Netflix series 'Barbie: Dreamhouse Adventures'. He is Stacie's puppy."}
{"_id":{"$oid":"5d0b97e8771b219e2a2a99bb"},"topic":"Pets","title":"Honey","content":"One of the sisters 4 puppies on the Netflix series 'Barbie: Dreamhouse Adventures'. She is Chelsea's puppy."}
{"_id":{"$oid":"5d0b9d71771b219e2a2a9b53"},"topic":"Careers","title":"Astronaut","content":"barbie-astronaut.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d46"},"topic":"Careers","title":"Robotics Engineer","content":"barbie-robo-engineer-1.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d49"},"topic":"Careers","title":"Athlete","content":"barbie-athlete.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d4c"},"topic":"Careers","title":"Gymnastics Coach","content":"barbie-gymnastics-coach.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d4f"},"topic":"Careers","title":"Popstar","content":"barbie-popstar.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d52"},"topic":"Careers","title":"Eye Doctor","content":"barbie-eye-doctor.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d55"},"topic":"Careers","title":"Robotics Engineer","content":"barbie-robo-engineer-2.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d58"},"topic":"Careers","title":"Firefighter","content":"barbie-firefighter.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d5b"},"topic":"Careers","title":"Political Candidate","content":"barbie-political-candidate.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d5e"},"topic":"Careers","title":"Artist","content":"barbie-artist.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d61"},"topic":"Careers","title":"Dentist","content":"barbie-dentist.jpeg"}
{"_id":{"$oid":"5d0ba3e3771b219e2a2a9d64"},"topic":"Careers","title":"Yoga Instructor","content":"barbie-yoga-instructor.jpeg"}
{"_id":{"$oid":"5d0bb50f771b219e2a2aa020"},"topic":"Movies/TV","title":"Barbie: Life in the Dreamhouse","content":"Barbie: Life in the Dreamhouse is an online web series of computer-animated shorts produced by Arc Productions, and Mattel. The series debuted on May 11, 2012 and is available on Barbie.com, Netflix and YouTube. Two TV specials aired on Nickelodeon on September 1, 2013. The series ended on November 27, 2015."}
{"_id":{"$oid":"5d0bb50f771b219e2a2aa023"},"topic":"Movies/TV","title":"Barbie Video Game Hero","content":"Get ready to power up! When Barbie magically gets pulled into her favorite video game, she is excited to see she's transformed into a fun roller-skating character. In the game, she meets Cutie, the lovable cloud-shaped friend, and Bella, the roller-skating princess. Together, they soon discover a mischievous emoji is trying to take control of the game. As they travel from level to level, Barbie must rely on her amazing gaming skills and out-of-the box thinking to save her team and beat the game!"}
{"_id":{"$oid":"5d0bb50f771b219e2a2aa026"},"topic":"Movies/TV","title":"Barbie: Dolphin Magic","content":"In this fun, underwater adventure, Barbie and her sisters visit Ken at his summer internship where he works at a coral reef researching dolphins. While diving and exploring the reef, the sisters discover rare, rainbow-colored dolphins who only visit once a year. This amazing find encourages them to learn more about preserving the coral and all the sea life that lives there. That's when they meet Isla, a mysterious new friend who's also on a mission to save the coral. What seems like a simple task turns out to be quite the adventure when it's revealed Isla is really a mermaid. But there's no time to celebrate having a mermaid for a friend, because Isla needs the help of Barbie and her sisters, and the gemstone dolphins to save the day."}
{"_id":{"$oid":"5d0bb50f771b219e2a2aa029"},"topic":"Movies/TV","title":"Barbie: Starlight Adventure","content":"Barbie is a cosmic princess who flies high on her hoverboard through a far-off universe with her adorable and devoted pet sidekick, Pupcorn. One day, everything changes when the twinkling stars start to dim and slow their dance in the sky. Barbie travels to a beautiful new planet to join a special rescue team on a mission to save the stars. Once there, she teams up with a group of talented new friends who work together to save the galaxy through exciting hoverboarding adventures. Barbie soon discovers that if she listens to her heart, and with the help of her friends, she might be the leader the whole universe has been waiting for!"}
{"_id":{"$oid":"5d0bb50f771b219e2a2aa02c"},"topic":"Movies/TV","title":"Barbie in Rock'n Royals","content":"Two worlds collide, when the modern aristocrat, Princess Courtney, and the famous rock star, Erika Juno, accidentally switch places with each other. Now, by an unintentional mix-up, the beautiful noblewoman arrives in Camp Pop, while the talented singer finds herself all alone in Camp Royalty. Little by little, as both rival camps attempt to remedy this awkward situation, the girls try their best to adjust, making unforeseen and exciting new friendships. Will the Princess and the Rock Star embrace their differences to shine at this summer's grand singing competition?"}
{"_id":{"$oid":"5d0bb50f771b219e2a2aa02f"},"topic":"Movies/TV","title":"Barbie (2020)","content":"A doll living in 'Barbieland' is expelled for not being perfect enough and sets off on an adventure in the real world. A Live-action feature film based on the popular line of Barbie toys."}
